In [1]:
import numpy as np
import pandas as pd

In [3]:
file_path=r"C:\Users\ashis\OneDrive\Desktop\Data Science\Batches\Practice Datasets\Titanic.csv"

In [14]:
names=['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit']
codes=[101, np.nan, np.nan, 104, 105, np.nan, 107, 108]
city=['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', np.nan, 'Goa']

In [40]:
data={'Name':names,
'ID':codes,
'City':city}

In [20]:
df=pd.DataFrame(data)

In [22]:
df

       Name     ID       City
0  Kushagra  101.0       Pune
1    Kartik    NaN    Madurai
2    Vikash    NaN    Chennai
3    Sukesh  104.0   Dehradun
4    Deepti  105.0      Noida
5     Priti    NaN  Bengaluru
6   Pranali  107.0        NaN
7      Amit  108.0        Goa

In [28]:
df['ID_FFL']=df.ID.ffill()

In [30]:
df

       Name     ID       City  ID_FFL
0  Kushagra  101.0       Pune   101.0
1    Kartik    NaN    Madurai   101.0
2    Vikash    NaN    Chennai   101.0
3    Sukesh  104.0   Dehradun   104.0
4    Deepti  105.0      Noida   105.0
5     Priti    NaN  Bengaluru   105.0
6   Pranali  107.0        NaN   107.0
7      Amit  108.0        Goa   108.0

In [34]:
df['City_BFL']=df.City.bfill()

In [36]:
df

       Name     ID       City  ID_FFL   City_BFL
0  Kushagra  101.0       Pune   101.0       Pune
1    Kartik    NaN    Madurai   101.0    Madurai
2    Vikash    NaN    Chennai   101.0    Chennai
3    Sukesh  104.0   Dehradun   104.0   Dehradun
4    Deepti  105.0      Noida   105.0      Noida
5     Priti    NaN  Bengaluru   105.0  Bengaluru
6   Pranali  107.0        NaN   107.0        Goa
7      Amit  108.0        Goa   108.0        Goa

In [64]:
names=['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit']
codes=[np.nan, np.nan, np.nan, 104, 105, np.nan, 107, np.nan]
city=['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', np.nan, 'Goa']

In [66]:
df=pd.DataFrame(data)

In [68]:
df

       Name     ID       City
0  Kushagra    NaN       Pune
1    Kartik    NaN    Madurai
2    Vikash    NaN    Chennai
3    Sukesh  104.0   Dehradun
4    Deepti  105.0      Noida
5     Priti    NaN  Bengaluru
6   Pranali  107.0        NaN
7      Amit    NaN        Goa

In [70]:
df.ID.ffill()

0      NaN
1      NaN
2      NaN
3    104.0
4    105.0
5    105.0
6    107.0
7    107.0
Name: ID, dtype: float64

In [78]:
df['ID_Fill']=df.ID.ffill().bfill()

In [80]:
df

       Name     ID       City  ID_Fill
0  Kushagra    NaN       Pune    104.0
1    Kartik    NaN    Madurai    104.0
2    Vikash    NaN    Chennai    104.0
3    Sukesh  104.0   Dehradun    104.0
4    Deepti  105.0      Noida    105.0
5     Priti    NaN  Bengaluru    105.0
6   Pranali  107.0        NaN    107.0
7      Amit    NaN        Goa    107.0

# Handling Duplicates

In [83]:
# - If the same row gets repetaed, we call it as duplicate row.

In [91]:
df=pd.concat((df,df.iloc[:2]), ignore_index=True)

In [93]:
df

       Name     ID       City  ID_Fill
0  Kushagra    NaN       Pune    104.0
1    Kartik    NaN    Madurai    104.0
2    Vikash    NaN    Chennai    104.0
3    Sukesh  104.0   Dehradun    104.0
4    Deepti  105.0      Noida    105.0
5     Priti    NaN  Bengaluru    105.0
6   Pranali  107.0        NaN    107.0
7      Amit    NaN        Goa    107.0
8  Kushagra    NaN       Pune    104.0
9    Kartik    NaN    Madurai    104.0

### duplicated()

In [98]:
# - It checks the duplicate rows and returns a boolean series.

df.duplicated().sum()

2

In [120]:
df[df.duplicated()]

       Name  ID     City  ID_Fill
8  Kushagra NaN     Pune    104.0
9    Kartik NaN  Madurai    104.0

In [110]:
df.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
dtype: bool

In [106]:
df.duplicated(keep='last')

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [108]:
df.duplicated(keep=False)

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
dtype: bool

In [112]:
df

       Name     ID       City  ID_Fill
0  Kushagra    NaN       Pune    104.0
1    Kartik    NaN    Madurai    104.0
2    Vikash    NaN    Chennai    104.0
3    Sukesh  104.0   Dehradun    104.0
4    Deepti  105.0      Noida    105.0
5     Priti    NaN  Bengaluru    105.0
6   Pranali  107.0        NaN    107.0
7      Amit    NaN        Goa    107.0
8  Kushagra    NaN       Pune    104.0
9    Kartik    NaN    Madurai    104.0

In [124]:
df.loc[6,'City']='Chennai'

In [126]:
df

       Name     ID       City  ID_Fill
0  Kushagra    NaN       Pune    104.0
1    Kartik    NaN    Madurai    104.0
2    Vikash    NaN    Chennai    104.0
3    Sukesh  104.0   Dehradun    104.0
4    Deepti  105.0      Noida    105.0
5     Priti    NaN  Bengaluru    105.0
6   Pranali  107.0    Chennai    107.0
7      Amit    NaN        Goa    107.0
8  Kushagra    NaN       Pune    104.0
9    Kartik    NaN    Madurai    104.0

In [132]:
df[df.duplicated(subset='City')]

       Name     ID     City  ID_Fill
6   Pranali  107.0  Chennai    107.0
8  Kushagra    NaN     Pune    104.0
9    Kartik    NaN  Madurai    104.0

In [134]:
df[df.duplicated(subset=['ID','City'])]

       Name  ID     City  ID_Fill
8  Kushagra NaN     Pune    104.0
9    Kartik NaN  Madurai    104.0

### Dropping the duplicates

### drop_duplicates()

In [138]:
# - It drops the duplicate rows and returns a new dataframe.

In [154]:
df.drop_duplicates(keep=False, inplace=True, ignore_index=True)

In [156]:
df

      Name     ID       City  ID_Fill
0   Vikash    NaN    Chennai    104.0
1   Sukesh  104.0   Dehradun    104.0
2   Deepti  105.0      Noida    105.0
3    Priti    NaN  Bengaluru    105.0
4  Pranali  107.0    Chennai    107.0
5     Amit    NaN        Goa    107.0

### info()

In [159]:
# - It returns a series that contains basis information about the dataframe.

In [161]:
df=pd.read_csv(file_path)

In [163]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [165]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### describe()

In [170]:
# - It returns the 5 point statistical summary.

In [172]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [177]:
df.describe(percentiles=[0.1, .2, .5, .75, .90, .95, .99])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
10%,90.000000,0.000000,1.000000,14.000000,0.000000,0.000000,7.550000
20%,179.000000,0.000000,1.000000,19.000000,0.000000,0.000000,7.854200
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
90%,802.000000,1.000000,3.000000,50.000000,1.000000,2.000000,77.958300
95%,846.500000,1.000000,3.000000,56.000000,3.000000,2.000000,112.079150
99%,882.100000,1.000000,3.000000,65.870000,5.000000,4.000000,249.006220
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [179]:
df.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [187]:
df.Survived.sum()/len(df)

0.3838383838383838

In [189]:
df.describe(include=object)

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [203]:
df.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

# Mathematical and Statistical Functions

### mean()

In [195]:
df.mean(numeric_only=True)

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [197]:
df.Fare.mean()

32.204207968574636

In [201]:
df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

### median()

In [208]:
df.median(numeric_only=True)

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [210]:
df.Age.median()

28.0

### sum()

In [215]:
df.sum(numeric_only=True)

PassengerId    397386.0000
Survived          342.0000
Pclass           2057.0000
Age             21205.1700
SibSp             466.0000
Parch             340.0000
Fare            28693.9493
dtype: float64

In [217]:
df.Fare.sum()

28693.9493

### min()

In [220]:
df.min(numeric_only=True)

PassengerId    1.00
Survived       0.00
Pclass         1.00
Age            0.42
SibSp          0.00
Parch          0.00
Fare           0.00
dtype: float64

In [222]:
df.Age.min()

0.42

### mmax()

In [225]:
df.max(numeric_only=True)

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [227]:
df.Age.max()

80.0

### mode()

In [232]:
# df.mode()

In [234]:
df.Age.mode()

0    24.0
Name: Age, dtype: float64

In [236]:
df.Sex.mode()

0    male
Name: Sex, dtype: object

In [238]:
df.Embarked.mode()

0    S
Name: Embarked, dtype: object

### std()

In [241]:
df.std(numeric_only=True)

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [243]:
df.Fare.std()

49.693428597180905

### var()

In [248]:
df.var(numeric_only=True)

PassengerId    66231.000000
Survived           0.236772
Pclass             0.699015
Age              211.019125
SibSp              1.216043
Parch              0.649728
Fare            2469.436846
dtype: float64

In [250]:
df.Age.var()

211.0191247463081

### quantile()

In [253]:
# - It is used to calculate the percentile value.

In [273]:
df.quantile(numeric_only=True, q=[.1, .25, 0.50, .75, .90, .95, .99])

      PassengerId  Survived  Pclass     Age  SibSp  Parch       Fare
0.10         90.0       0.0     1.0  14.000    0.0    0.0    7.55000
0.25        223.5       0.0     2.0  20.125    0.0    0.0    7.91040
0.50        446.0       0.0     3.0  28.000    0.0    0.0   14.45420
0.75        668.5       1.0     3.0  38.000    1.0    0.0   31.00000
0.90        802.0       1.0     3.0  50.000    1.0    2.0   77.95830
0.95        846.5       1.0     3.0  56.000    3.0    2.0  112.07915
0.99        882.1       1.0     3.0  65.870    5.0    4.0  249.00622

In [277]:
df.Age.quantile([.25, .50])

0.25    20.125
0.50    28.000
Name: Age, dtype: float64

### corr()

In [280]:
# - It returns the coorelation matrix.

In [284]:
df.corr(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [286]:
df[['Age', 'Fare']].corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

# Changing the column names

In [299]:
# df.rename({col_name:new_name}, axis=1, inplace=True)

In [301]:
# Sex-Gender
# Parch-Parents
# SibSp- Siblings

In [307]:
df.rename({'Sex':'Gender', 'SibSp':'Siblings', 'Parch':'Parents'}, axis=1, inplace=True)

In [309]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,Siblings,Parents,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Data Filteration

### Conditions

In [311]:
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,Siblings,Parents,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [323]:
# Get the data of the male passengers

df[df.Gender=='male']

,PassengerId,Survived,Pclass,Name,Gender,Age,Siblings,Parents,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [331]:
# Get the Average Fare of Male Passengers

df[df.Gender=='male']['Fare'].mean()

25.523893414211443

In [341]:
# Get the data of male passengers travelling in Pclass 3
# Gender
# Pclass

df[(df.Gender=='male')&(df.Pclass==3)]

,PassengerId,Survived,Pclass,Name,Gender,Age,Siblings,Parents,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [349]:
# Get the Fare of male passengers travelling in Pclass 3

df[(df.Gender=='male')&(df.Pclass==3)]['Fare'].mean()

12.661632564841499

In [365]:
# Average Fare of Male Female Passengers travelling in Pclass 3 and survived.

# Gender
# Pclass
# Survived

df[(df.Gender=='male')&(df.Pclass==3)&(df.Survived==1)]['Fare'].mean()

15.579695744680853

In [367]:
df[(df.Gender=='female')&(df.Pclass==3)&(df.Survived==1)]['Fare'].mean()

12.464526388888888

In [369]:
# Average Fare in each Pclass Gender wise for the passengers who survived

In [371]:
df[(df.Gender=='male')&(df.Pclass==1)&(df.Survived==1)]['Fare'].mean()

74.63732

In [373]:
df[(df.Gender=='female')&(df.Pclass==1)&(df.Survived==1)]['Fare'].mean()

105.97815934065933

In [375]:
df[(df.Gender=='male')&(df.Pclass==2)&(df.Survived==1)]['Fare'].mean()

21.095100000000002

In [379]:
df[(df.Gender=='female')&(df.Pclass==2)&(df.Survived==1)]['Fare'].mean()

22.288988571428572

In [381]:
df[(df.Gender=='male')&(df.Pclass==3)&(df.Survived==1)]['Fare'].mean()

15.579695744680853

In [383]:
df[(df.Gender=='female')&(df.Pclass==3)&(df.Survived==1)]['Fare'].mean()

12.464526388888888

### groupby()

In [394]:
# - It is used to analyse two or more variables together.
# - It returns a series object.

In [388]:
# df.groupby(col).col.function()

In [390]:
# Average Fare of Male and Female Passengers travelling in Pclass 3

# Gender
# Fare
# Operation - mean (Fare)

In [392]:
df.groupby('Gender').Fare.mean()

Gender
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [396]:
df.groupby('Gender')['Fare'].mean()

Gender
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [400]:
# Average Fare in each Pclass Gender wise for the passengers

# Gender
# Pclass
# Fare
# Operation - mean (Fare)

In [402]:
df.groupby(['Gender', 'Pclass']).Fare.mean()

Gender  Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [404]:
df.groupby(['Pclass', 'Gender']).Fare.mean()

Pclass  Gender
1       female    106.125798
        male       67.226127
2       female     21.970121
        male       19.741782
3       female     16.118810
        male       12.661633
Name: Fare, dtype: float64

In [410]:
# Average Fare in each Pclass Gender wise for the passengers as per the survival status

# Gender
# Pclass
# Survived
# Fare
# Operation - mean (Fare)

In [408]:
df.groupby(['Pclass', 'Gender', 'Survived']).Fare.mean()

Pclass  Gender  Survived
1       female  0           110.604167
                1           105.978159
        male    0            62.894910
                1            74.637320
2       female  0            18.250000
                1            22.288989
        male    0            19.488965
                1            21.095100
3       female  0            19.773093
                1            12.464526
        male    0            12.204469
                1            15.579696
Name: Fare, dtype: float64

In [413]:
# How many male and female passengers in each Pclass

# Gedner
# Pclass

# Operation - value_counts() (Gender/Pclass)

In [415]:
df.groupby('Gender').Pclass.value_counts()

Gender  Pclass
female  3         144
        1          94
        2          76
male    3         347
        1         122
        2         108
Name: count, dtype: int64

In [417]:
df.groupby('Pclass').Gender.value_counts()

Pclass  Gender
1       male      122
        female     94
2       male      108
        female     76
3       male      347
        female    144
Name: count, dtype: int64

### pivot_table()

In [420]:
# - It is used to summarise multiple columns.
# - It returns a dataframe.

In [424]:
# pd.pivot_table(df, values=, index=, columns=, aggfunc=)

In [426]:
path=r"C:\Users\ashis\OneDrive\Desktop\Data Science\Batches\Practice Datasets\sales.xlsx"

In [430]:
sls=pd.read_excel(path)

In [432]:
sls.head()

   Year    Month           Type Salesperson Region    Sales  Units  Order #
0  2013  January      Ice Cream      Bishop   West   2395.5   1597        1
1  2013  January      Ice Cream      Bishop   West  11761.5   7841        2
2  2013  January  Frozen Yogurt      Bishop   West   8943.0   5962        3
3  2013  January      Ice Cream      Bishop   West   2395.5   1597        4
4  2013  January      Ice Cream      Bishop   West  11761.5   7841        5

In [434]:
sls.shape

(60, 8)

In [436]:
sls.Year.unique()

array([2013, 2014, 2015], dtype=int64)

In [438]:
sls.Month.unique()

array(['January'], dtype=object)

In [442]:
# Region wise total Sales

# Region
# Sales
# Operation - sum (Sales)

In [444]:
sls.groupby('Region').Sales.sum()

Region
Central    280674.0
North       72741.0
South       21321.0
West       138600.0
Name: Sales, dtype: float64

In [446]:
pd.pivot_table(sls, values='Sales', index='Region', aggfunc='sum')

            Sales
Region
Central  280674.0
North     72741.0
South     21321.0
West     138600.0

In [448]:
pd.pivot_table(sls, values='Sales', columns='Region', aggfunc='sum')

Region   Central    North    South      West
Sales   280674.0  72741.0  21321.0  138600.0

In [450]:
# Region wise total Sales of each product

# Region
# Sales
# Type
# Operation - sum (Sales)

In [458]:
pd.pivot_table(sls, values='Sales', index='Region', columns='Type', aggfunc='sum', fill_value=0)

Type     Frozen Yogurt  Ice Cream  Popsicles  Tasty Treats
Region
Central       175158.0        0.0        0.0      105516.0
North              0.0    72741.0        0.0           0.0
South              0.0        0.0    21321.0           0.0
West           53658.0    84942.0        0.0           0.0

In [466]:
pd.pivot_table(sls, values='Sales', columns='Region', index='Type', aggfunc='sum', fill_value=0)

Region          Central    North    South     West
Type
Frozen Yogurt  175158.0      0.0      0.0  53658.0
Ice Cream           0.0  72741.0      0.0  84942.0
Popsicles           0.0      0.0  21321.0      0.0
Tasty Treats   105516.0      0.0      0.0      0.0

In [468]:
pd.pivot_table(sls, values='Sales', index=['Region', 'Type'], aggfunc='sum', fill_value=0)

                          Sales
Region  Type
Central Frozen Yogurt  175158.0
        Tasty Treats   105516.0
North   Ice Cream       72741.0
South   Popsicles       21321.0
West    Frozen Yogurt   53658.0
        Ice Cream       84942.0

In [470]:
pd.pivot_table(sls, values='Sales', columns=['Region', 'Type'], aggfunc='sum', fill_value=0)

Region       Central                  North     South          West
Type   Frozen Yogurt Tasty Treats Ice Cream Popsicles Frozen Yogurt Ice Cream
Sales       175158.0     105516.0   72741.0   21321.0       53658.0   84942.0

In [472]:
# Region wise total Sales of each product sold by each Salesperson

# Region
# Sales
# Type
# Salesperson
# Operation - sum (Sales)

In [476]:
pd.pivot_table(sls, values='Sales', index='Region', columns=['Salesperson', 'Type'],aggfunc='sum', fill_value=0)

Salesperson        Bishop                     Lee                 Parker  \
Type        Frozen Yogurt Ice Cream Frozen Yogurt Tasty Treats Ice Cream
Region
Central               0.0       0.0       87579.0      52758.0       0.0
North                 0.0       0.0           0.0          0.0   72741.0
South                 0.0       0.0           0.0          0.0       0.0
West              53658.0   84942.0           0.0          0.0       0.0

Salesperson    Pullen        Watson
Type        Popsicles Frozen Yogurt Tasty Treats
Region
Central           0.0       87579.0      52758.0
North             0.0           0.0          0.0
South         21321.0           0.0          0.0
West              0.0           0.0          0.0

In [478]:
# Region wise total Sales and total units sold of each product sold by each Salesperson

# Region
# Sales
# Type
# Salesperson
# Units
# Operation - sum (Sales + Units)

In [484]:
pd.pivot_table(sls, values=['Sales', 'Units'], index='Region', columns=['Salesperson', 'Type'],aggfunc='sum', fill_value=0)

                    Sales                                                 \
Salesperson        Bishop                     Lee                 Parker
Type        Frozen Yogurt Ice Cream Frozen Yogurt Tasty Treats Ice Cream
Region
Central               0.0       0.0       87579.0      52758.0       0.0
North                 0.0       0.0           0.0          0.0   72741.0
South                 0.0       0.0           0.0          0.0       0.0
West              53658.0   84942.0           0.0          0.0       0.0

                                                         Units            \
Salesperson    Pullen        Watson                     Bishop
Type        Popsicles Frozen Yogurt Tasty Treats Frozen Yogurt Ice Cream
Region
Central           0.0       87579.0      52758.0             0         0
North             0.0           0.0          0.0             0         0
South         21321.0           0.0          0.0             0         0
West              0.0           0.0          0.0         35772     56628

                                                                          \
Salesperson           Lee                 Parker    Pullen        Watson
Type        Frozen Yogurt Tasty Treats Ice Cream Popsicles Frozen Yogurt
Region
Central             58386        35172         0         0         58386
North                   0            0     63012         0             0
South                   0            0         0     14214             0
West                    0            0         0         0             0


Salesperson
Type        Tasty Treats
Region
Central            35172
North                  0
South                  0
West                   0

In [486]:
# Region wise total Sales and Average Sales and total units sold and Average Units of each product sold by each Salesperson

# Region
# Sales
# Type
# Salesperson
# Units
# Operation - (sum + mean) (Sales + Units)

In [492]:
pd.pivot_table(sls, 
               values=['Sales', 'Units'], 
               index='Region', 
               columns=['Salesperson', 'Type'],
               aggfunc=['sum', 'mean'], fill_value=0).T

Region                                Central     North    South     West
           Salesperson Type
sum  Sales Bishop      Frozen Yogurt      0.0      0.00      0.0  53658.0
                       Ice Cream          0.0      0.00      0.0  84942.0
           Lee         Frozen Yogurt  87579.0      0.00      0.0      0.0
                       Tasty Treats   52758.0      0.00      0.0      0.0
           Parker      Ice Cream          0.0  72741.00      0.0      0.0
           Pullen      Popsicles          0.0      0.00  21321.0      0.0
           Watson      Frozen Yogurt  87579.0      0.00      0.0      0.0
                       Tasty Treats   52758.0      0.00      0.0      0.0
     Units Bishop      Frozen Yogurt      0.0      0.00      0.0  35772.0
                       Ice Cream          0.0      0.00      0.0  56628.0
           Lee         Frozen Yogurt  58386.0      0.00      0.0      0.0
                       Tasty Treats   35172.0      0.00      0.0      0.0
           Parker      Ice Cream          0.0  63012.00      0.0      0.0
           Pullen      Popsicles          0.0      0.00  14214.0      0.0
           Watson      Frozen Yogurt  58386.0      0.00      0.0      0.0
                       Tasty Treats   35172.0      0.00      0.0      0.0
mean Sales Bishop      Frozen Yogurt      0.0      0.00      0.0   8943.0
                       Ice Cream          0.0      0.00      0.0   7078.5
           Lee         Frozen Yogurt  14596.5      0.00      0.0      0.0
                       Tasty Treats    8793.0      0.00      0.0      0.0
           Parker      Ice Cream          0.0   6061.75      0.0      0.0
           Pullen      Popsicles          0.0      0.00   3553.5      0.0
           Watson      Frozen Yogurt  14596.5      0.00      0.0      0.0
                       Tasty Treats    8793.0      0.00      0.0      0.0
     Units Bishop      Frozen Yogurt      0.0      0.00      0.0   5962.0
                       Ice Cream          0.0      0.00      0.0   4719.0
           Lee         Frozen Yogurt   9731.0      0.00      0.0      0.0
                       Tasty Treats    5862.0      0.00      0.0      0.0
           Parker      Ice Cream          0.0   5251.00      0.0      0.0
           Pullen      Popsicles          0.0      0.00   2369.0      0.0
           Watson      Frozen Yogurt   9731.0      0.00      0.0      0.0
                       Tasty Treats    5862.0      0.00      0.0      0.0

In [506]:
pd.pivot_table(sls, values='Sales', index='Region', 
               columns=['Salesperson', 'Type'],
               aggfunc='min', fill_value=0)

Salesperson        Bishop                     Lee                 Parker  \
Type        Frozen Yogurt Ice Cream Frozen Yogurt Tasty Treats Ice Cream
Region
Central               0.0       0.0       14596.5       8793.0       0.0
North                 0.0       0.0           0.0          0.0    4666.0
South                 0.0       0.0           0.0          0.0       0.0
West               8943.0    2395.5           0.0          0.0       0.0

Salesperson    Pullen        Watson
Type        Popsicles Frozen Yogurt Tasty Treats
Region
Central           0.0       14596.5       8793.0
North             0.0           0.0          0.0
South          3553.5           0.0          0.0
West              0.0           0.0          0.0

# Data Cleaning and Transformation

In [509]:
# - Typecasting
# - apply()
# - Cleaning (Regex)
# - Capping
# - Bining
# - Encoding (OHE/Label/TE)
# Merging
# Concatenation
# Iterating over a Dataframe
# Exporting a dataframe

### Typecasting

### astype()

In [513]:
# - It typecasts a series or a dataframe and returns a new object.

In [539]:
names=['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit']
codes=[101, 102, 103, 104, 105, 106, 107, 108]
city=['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', 'Chennai', 'Goa']
salary=['55000', '61000', '57000', '92000', '88000', '75000', '71000', '62000']

In [541]:
data={'Name':names,
     'ID':codes,
     'City':city,
     'Salary':salary}

df=pd.DataFrame(data)

In [545]:
df

       Name   ID       City Salary
0  Kushagra  101       Pune  55000
1    Kartik  102    Madurai  61000
2    Vikash  103    Chennai  57000
3    Sukesh  104   Dehradun  92000
4    Deepti  105      Noida  88000
5     Priti  106  Bengaluru  75000
6   Pranali  107    Chennai  71000
7      Amit  108        Goa  62000

In [547]:
df.dtypes

Name      object
ID         int64
City      object
Salary    object
dtype: object

In [549]:
df.Salary=df.Salary.astype(int)

In [551]:
df

       Name   ID       City  Salary
0  Kushagra  101       Pune   55000
1    Kartik  102    Madurai   61000
2    Vikash  103    Chennai   57000
3    Sukesh  104   Dehradun   92000
4    Deepti  105      Noida   88000
5     Priti  106  Bengaluru   75000
6   Pranali  107    Chennai   71000
7      Amit  108        Goa   62000

In [553]:
df.dtypes

Name      object
ID         int64
City      object
Salary     int32
dtype: object

In [555]:
df.Salary.max()

92000

In [567]:
names=['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit']
codes=[101, 102, 103, 104, 105, 106, 107, 108]
city=['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', 'Chennai', 'Goa']
salary=['.', '61000', '-', '92000', '88000', '', '71000', '62000']

In [641]:
data={'Name':names,
     'ID':codes,
     'City':city,
     'Salary':salary}

df=pd.DataFrame(data)

In [571]:
df

       Name   ID       City Salary
0  Kushagra  101       Pune      .
1    Kartik  102    Madurai  61000
2    Vikash  103    Chennai      -
3    Sukesh  104   Dehradun  92000
4    Deepti  105      Noida  88000
5     Priti  106  Bengaluru
6   Pranali  107    Chennai  71000
7      Amit  108        Goa  62000

In [580]:
# int('.')

In [582]:
# df.Salary.astype(int)

In [596]:
df.loc[df.Salary=='.','Salary']=np.nan

In [602]:
df

       Name   ID       City Salary
0  Kushagra  101       Pune    NaN
1    Kartik  102    Madurai  61000
2    Vikash  103    Chennai      -
3    Sukesh  104   Dehradun  92000
4    Deepti  105      Noida  88000
5     Priti  106  Bengaluru
6   Pranali  107    Chennai  71000
7      Amit  108        Goa  62000

In [636]:
# df.Salary.astype(float)

In [610]:
df.loc[df.Salary=='-', 'Salary']=np.nan

In [612]:
df

       Name   ID       City Salary
0  Kushagra  101       Pune    NaN
1    Kartik  102    Madurai  61000
2    Vikash  103    Chennai    NaN
3    Sukesh  104   Dehradun  92000
4    Deepti  105      Noida  88000
5     Priti  106  Bengaluru
6   Pranali  107    Chennai  71000
7      Amit  108        Goa  62000

In [634]:
# df.Salary.astype(float)

In [622]:
df.loc[df.Salary=='', 'Salary']=np.nan

In [624]:
df

       Name   ID       City Salary
0  Kushagra  101       Pune    NaN
1    Kartik  102    Madurai  61000
2    Vikash  103    Chennai    NaN
3    Sukesh  104   Dehradun  92000
4    Deepti  105      Noida  88000
5     Priti  106  Bengaluru    NaN
6   Pranali  107    Chennai  71000
7      Amit  108        Goa  62000

In [628]:
df.Salary=df.Salary.astype(float)

In [630]:
df

       Name   ID       City   Salary
0  Kushagra  101       Pune      NaN
1    Kartik  102    Madurai  61000.0
2    Vikash  103    Chennai      NaN
3    Sukesh  104   Dehradun  92000.0
4    Deepti  105      Noida  88000.0
5     Priti  106  Bengaluru      NaN
6   Pranali  107    Chennai  71000.0
7      Amit  108        Goa  62000.0

In [632]:
df.dtypes

Name       object
ID          int64
City       object
Salary    float64
dtype: object

### pd.to_numeric()

In [639]:
# - It typcasts to numeric.

In [643]:
df

       Name   ID       City Salary
0  Kushagra  101       Pune      .
1    Kartik  102    Madurai  61000
2    Vikash  103    Chennai      -
3    Sukesh  104   Dehradun  92000
4    Deepti  105      Noida  88000
5     Priti  106  Bengaluru
6   Pranali  107    Chennai  71000
7      Amit  108        Goa  62000

In [651]:
# float('-')

In [655]:
df.Salary=pd.to_numeric(df.Salary, errors='coerce')

In [657]:
df

       Name   ID       City   Salary
0  Kushagra  101       Pune      NaN
1    Kartik  102    Madurai  61000.0
2    Vikash  103    Chennai      NaN
3    Sukesh  104   Dehradun  92000.0
4    Deepti  105      Noida  88000.0
5     Priti  106  Bengaluru      NaN
6   Pranali  107    Chennai  71000.0
7      Amit  108        Goa  62000.0

In [659]:
df.dtypes

Name       object
ID          int64
City       object
Salary    float64
dtype: object

In [661]:
names=['Kushagra', 'Kartik', 'Vikash', 'Sukesh', 'Deepti', 'Priti', 'Pranali', 'Amit']
codes=[101, 102, 103, 104, 105, 106, 107, 108]
city=['Pune', 'Madurai', 'Chennai', 'Dehradun', 'Noida', 'Bengaluru', 'Chennai', 'Goa']
salary=['.', '$61000', '-', '$92000', '$88000', '', '$71000', '$62000']

In [663]:
data={'Name':names,
     'ID':codes,
     'City':city,
     'Salary':salary}

df=pd.DataFrame(data)

In [665]:
df

       Name   ID       City  Salary
0  Kushagra  101       Pune       .
1    Kartik  102    Madurai  $61000
2    Vikash  103    Chennai       -
3    Sukesh  104   Dehradun  $92000
4    Deepti  105      Noida  $88000
5     Priti  106  Bengaluru
6   Pranali  107    Chennai  $71000
7      Amit  108        Goa  $62000

In [671]:
pd.to_numeric(df.Salary, errors='coerce')

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
Name: Salary, dtype: float64

In [675]:
float('$200')

ValueError: could not convert string to float: '$200'